# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Binaries
brew "coreutils"
brew "asdf"
brew "awscli"
# brew "bash"
brew "bazel"
brew "cask"
brew "curl"
brew "exercism"
brew "git"
brew "git-standup"
brew "gnupg"
brew "gtk-mac-integration"
brew "ipfs"
brew "jid"
brew "jq"
brew "mas"
brew "tree"

brew 'launchctl-completion'
# brew "bash-completion@2"
brew "zsh-completion"
brew "cargo-completion"
brew "rustc-completion"
brew "open-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "docker-machine-completion"
brew "tmuxinator-completion"

cask "minikube"
cask "virtualbox"
cask "virtualbox-extension-pack"
brew "minikube"
brew "mitmproxy"
brew "postgresql"
brew "skaffold"
brew "kompose"
brew "kubernetes-cli"
brew "kubectx"
brew "leveldb"
brew "hyperkit"
brew "helm"

brew "youtube-dl"
cask 'whatsapp'


brew "zsh"
brew "nano"
brew "grep"
brew "tmux"
brew "reattach-to-user-namespace"

# Apps
cask "adoptopenjdk8"
cask "launchbar"
cask "little-snitch"
cask "jumpcut"
cask "docker"
cask "dropbox"
cask "firefox"
cask "firefox-nightly"
cask "google-chrome"
cask "google-chrome-canary"
cask "opera"
cask "iterm2"
cask 'visual-studio-code'
cask 'tableplus'
cask 'postman'
cask "flux"
cask "slack"
cask 'discord'
cask 'signal'
cask "vlc"
cask "iina"
cask 'transmission'
cask 'steam'
cask 'disk-inventory-x'


# Font
cask "font-hack-nerd-font"
cask "font-source-code-pro"
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas "Xcode", id: 497799835
mas "Airmail", id: 918858936
mas "Canary Mail", id: 1236045954
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas 'Giphy Capture', id: 668208984
mas "The Unarchiver", id: 425424353